In [9]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

In [15]:
query10 = '''SELECT name, total_revenue
    FROM
    (SELECT name, sum(revenue) AS total_revenue
    From(
        SELECT name,
        CASE WHEN memid = 0 
            THEN guestcost * slots
        ELSE 
            membercost * slots END AS revenue
        FROM Bookings
        LEFT JOIN Facilities
        USING (facid)
        ) AS innerquery
    GROUP BY name) AS outersubquery
    WHERE total_revenue < 1000
    ORDER BY total_revenue'''

df = pd.read_sql_query(query10, engine)
print(df)

            name  total_revenue
0   Table Tennis            180
1  Snooker Table            240
2     Pool Table            270

In [17]:
query11 = '''SELECT m1.surname, m1.firstname,
    m2.surname AS recommendedby_surname,
    m2.firstname AS recommendedby_firstname
    FROM Members m1
    LEFT JOIN Members as m2
    ON m1.recommendedby = m2.memid
    WHERE m1.recommendedby != 0
    ORDER BY m1.surname, m1.firstname'''
df = pd.read_sql_query(query11, engine)
print(df)

              surname  firstname recommendedby_surname recommendedby_firstname
0               Bader   Florence              Stibbons                  Ponder
1               Baker       Anne              Stibbons                  Ponder
2               Baker    Timothy               Farrell                  Jemima
3              Boothe        Tim                Rownam                     Tim
4             Butters     Gerald                 Smith                  Darren
5              Coplin       Joan                 Baker                 Timothy
6             Crumpet      Erica                 Smith                   Tracy
7                Dare      Nancy              Joplette                  Janice
8             Farrell      David                  None                    None
9             Farrell     Jemima                  None                    None
10              GUEST      GUEST                  None                    None
11            Genting    Matthew               Butters                  Gerald
12               Hunt       John               Purview               Millicent
13              Jones      David              Joplette                  Janice
14              Jones    Douglas                 Jones                   David
15           Joplette     Janice                 Smith                  Darren
16          Mackenzie       Anna                 Smith                  Darren
17               Owen    Charles                 Smith                  Darren
18             Pinker      David               Farrell                  Jemima
19            Purview  Millicent                 Smith                   Tracy
20             Rownam        Tim                  None                    None
21             Rumney  Henrietta               Genting                 Matthew
22             Sarwin  Ramnaresh                 Bader                Florence
23              Smith     Darren                  None                    None
24              Smith     Darren                  None                    None
25              Smith       Jack                 Smith                  Darren
26              Smith      Tracy                  None                    None
27           Stibbons     Ponder                 Tracy                  Burton
28              Tracy     Burton                  None                    None
29         Tupperware   Hyacinth                  None                    None
30  Worthington-Smyth      Henry                 Smith                   Tracy

In [18]:
query12 = '''SELECT name AS facility, count(memid) AS usage_by_members
    FROM Bookings as b
    INNER JOIN Facilities as f
    USING (facid)
    WHERE b.memid <> 0
    GROUP BY b.facid'''

df = pd.read_sql_query(query12, engine)
print(df)

          facility  usage_by_members
0   Tennis Court 1               308
1   Tennis Court 2               276
2  Badminton Court               344
3     Table Tennis               385
4   Massage Room 1               421
5   Massage Room 2                27
6     Squash Court               195
7    Snooker Table               421
8       Pool Table               783

In [19]:
query13 = ''' SELECT name AS facilities,
    strftime('%m', starttime) AS month,
    COUNT(memid) AS monthly_usage
    FROM Bookings AS b
    INNER JOIN Facilities as f
    USING (facid)
    WHERE memid <> 0
    GROUP BY facid, month'''

df = pd.read_sql_query(query12,engine)
print(df)

          facility  usage_by_members
0   Tennis Court 1               308
1   Tennis Court 2               276
2  Badminton Court               344
3     Table Tennis               385
4   Massage Room 1               421
5   Massage Room 2                27
6     Squash Court               195
7    Snooker Table               421
8       Pool Table               783